handlers/discount-api/lambda/test/fixtures/digital-subscriptions/get-discount-test.json

{
  "success": true,
  "id": "8a12943c880a9cc6018818a99bf909ef",
  "accountId": "8a12976380bd0c8a0180c4c7cc440605",
  "accountNumber": "A01621744",
  "accountName": "0015I000008ZVNyQAO",
  "invoiceOwnerAccountId": "8a12976380bd0c8a0180c4c7cc440605",
  "invoiceOwnerAccountNumber": "A01621744",
  "invoiceOwnerAccountName": "0015I000008ZVNyQAO",
  "subscriptionNumber": "A-S01675043",
  "version": 2,
  "revision": "2.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2022-05-14",
  "serviceActivationDate": "2022-05-14",
  "customerAcceptanceDate": "2022-05-30",
  "subscriptionStartDate": "2022-05-14",
  "subscriptionEndDate": "2024-05-14",
  "lastBookingDate": "2023-05-14",
  "termStartDate": "2023-05-14",
  "termEndDate": "2024-05-14",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 17.92,
  "totalContractedValue": 420.44,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "05050a7e-e564-5db3-0000-000000027458",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "ANNUAL-INTRO-AU",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "ANNUAL-INTRO-AU",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a12943c880a9cc6018818a99c0009f1",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff5345f9220153559d915d5c26",
      "productRatePlanNumber": null,
      "ratePlanName": "Percentage",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": null,
      "ratePlanCharges": [
        {
          "id": "8a12943c880a9cc6018818a99c0609f3",
          "originalChargeId": "8a12976380bd0c8a0180c4c7cce9060f",
          "productRatePlanChargeId": "2c92a0fd5345efa10153559e97bb76c6",
          "number": "C-03544786",
          "name": "Percentage",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 2,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "AUD",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "prorationOption": null,
          "isStackedDiscount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2022-05-30",
          "effectiveEndDate": "2023-05-30",
          "processedThroughDate": "2022-05-30",
          "chargedThroughDate": "2022-06-30",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0,
          "dmrc": 0,
          "tcv": 0,
          "dtcv": 0,
          "originalOrderDate": "2022-05-14",
          "amendedByOrderOn": "2023-05-14",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "18.61% discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 18.61
        }
      ]
    },
    {
      "id": "8a12943c880a9cc6018818a99c0a09f7",
      "productId": "2c92a0fb4edd70c8014edeaa4ddb21e7",
      "productName": "Digital Pack",
      "productSku": "ABC-00000005",
      "productRatePlanId": "2c92a0fb4edd70c8014edeaa4e972204",
      "productRatePlanNumber": null,
      "ratePlanName": "Digital Pack Annual",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": null,
      "ratePlanCharges": [
        {
          "id": "8a12943c880a9cc6018818a99c0d09f9",
          "originalChargeId": "8a12976380bd0c8a0180c4c7cd100614",
          "productRatePlanChargeId": "2c92a0fb4edd70c9014edeaa5001218c",
          "number": "C-03544787",
          "name": "Digital Pack Annual",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 2,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "AUD",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToTermStart",
          "quantity": 1,
          "prorationOption": null,
          "isStackedDiscount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2022-05-30",
          "effectiveEndDate": "2024-05-14",
          "processedThroughDate": "2023-05-30",
          "chargedThroughDate": "2024-05-30",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 17.916666667,
          "dmrc": 0,
          "tcv": 420.44444445,
          "dtcv": 215,
          "originalOrderDate": "2022-05-14",
          "amendedByOrderOn": "2023-05-14",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "AUD215",
          "price": 215,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-00642297",
  "externallyManagedBy": null,
  "statusHistory": [
    { "startDate": "2022-05-14", "endDate": "2024-05-14", "status": "Active" },
    { "startDate": "2024-05-14", "endDate": null, "status": "OutOfTerm" }
  ]
}
